//В книге на одной странице помещается N строк. Таким образом, на 1-й странице печатаются строки с 1-й по N-ю, на второй — с (V+1)-й по (2∙V)-ю и т.д. 
//Нужно написать программу, которая по номеру строки в тексте определяет номер страницы, на которой будет напечатана эта строка, и порядковый номер этой строки на странице.
//Входные данные
//Вводятся два числа: N — количество строк, которое печатается на странице, и V — номер строки (1≤N≤200, 1≤V≤20000).
//Выходные данные
//Выведите два числа — номер страницы, на которой будет напечатана эта строка, и номер строки на странице.

#include <iostream>
#include<math.h>
using namespace std;
int str,nc,k,n;						


int main (){
	setlocale (LC_ALL,"Russian");
	cout <<"Введите количество строк на странице ";
	cin>>n;
	cout<<"Введите номер строки из текста ";
	cin>>v;
	if( k>200){								//проверка условий
		cout<<"Введены не верные данные  "<<endl;
		if(v>20000){
			cout<<"Введены не верные данные  "<<endl;
			if(n<1){
				cout<<"Введены не верные данные  "<<endl;
				if(v<1){
					cout<<"Введены не верные данные  "<<endl;
				}
			}
		}
	}
	else{
		str=v/n;
		nc=v%n;
		if (nc==0){
			nc=n;
		}
		else {
			str=str+1;
		}
		cout<<"Номер страницы "<<str<<endl;
		cout<<"Номер строки на странице "<<nc<<endl;
	}
	system("pause");
	return 0;
}
